# Cleaning

## Import Libraries

In [3]:
import pandas as pd
import re

In [4]:
# Cleaning functions (py file) placed in src folder.
import sys
sys.path.append("/")
from src.cleaning import *

## Import data from scrapping

In [5]:
mysql = pd.read_csv("mysql.csv")

In [6]:
mongo = pd.read_csv("mongo.csv")

In [7]:
tableau = pd.read_csv("tableau.csv")

In [8]:
python = pd.read_csv("python.csv")

In [9]:
ml = pd.read_csv("machine_learning.csv")

In [10]:
java = pd.read_csv("java.csv")

In [11]:
courses = pd.concat([mysql, mongo, tableau, python, ml, java])

In [12]:
courses = courses.reset_index()

In [13]:
courses.drop('Unnamed: 0', axis=1, inplace=True)

In [14]:
courses.drop('index', axis=1, inplace=True)

## Evaluation of data

In [15]:
courses.shape

(3140, 6)

In [16]:
courses.head(3)

,course,rating,students,level,university,skills
0,Learn SQL Basics for Data Science,4.6,400 mil,Beginner,"University of California, Davis",MySQL
1,Excel to MySQL: Analytic Techniques for Business,4.6,660 mil,Beginner,Duke University,MySQL
2,Introduction to Structured Query Language (SQL),4.8,140 mil,Intermediate,University of Michigan,MySQL

In [17]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3140 entries, 0 to 3139
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   course      3140 non-null   object
 1   rating      3140 non-null   object
 2   students    3140 non-null   object
 3   level       3140 non-null   object
 4   university  3140 non-null   object
 5   skills      3140 non-null   object
dtypes: object(6)
memory usage: 147.3+ KB

In [18]:
# Check if I have duplicated courses obtained from my different courses search.

In [19]:
# Hago una comprobación para ver si tengo cursos repetidos en mis búsquedas de los diferentes cursos.

In [20]:
no_skills= courses.drop(['skills'], axis=1)

In [21]:
no_skills.head()

,course,rating,students,level,university
0,Learn SQL Basics for Data Science,4.6,400 mil,Beginner,"University of California, Davis"
1,Excel to MySQL: Analytic Techniques for Business,4.6,660 mil,Beginner,Duke University
2,Introduction to Structured Query Language (SQL),4.8,140 mil,Intermediate,University of Michigan
3,Managing Big Data with MySQL,4.7,170 mil,Mixed,Duke University
4,Building a Dynamic Web App using PHP & MySQL,4.4,"5,8 mil",Beginner,Coursera Project Network

In [22]:
# These are the duplicated lists
df = no_skills[no_skills.duplicated(keep=False)]

df = df.groupby(df.columns.tolist()).apply(lambda x: x.index.tolist()).values.tolist()

In [23]:
flat_list = []
for l in df:
    for item in l:
        flat_list.append(item)

In [24]:
duplicated = courses.iloc[flat_list]

In [25]:
duplicated

,course,rating,students,level,university,skills
860,2.- El Cálculo - Modelo Cuadrático,4.8,16 mil,Mixed,Tecnológico de Monterrey,Python
1955,2.- El Cálculo - Modelo Cuadrático,4.8,16 mil,Mixed,Tecnológico de Monterrey,Machine Learning
764,AI Capstone Project with Deep Learning,4.5,10 mil,Advanced,IBM,Python
1704,AI Capstone Project with Deep Learning,4.5,10 mil,Advanced,IBM,Machine Learning
1368,AI For Everyone,4.8,750 mil,Beginner,DeepLearning.AI,Machine Learning
...,...,...,...,...,...,...
1932,모두를 위한 머신 러닝,None,None,Beginner,University of London,Machine Learning
1940,신경망 및 딥 러닝,None,None,Intermediate,DeepLearning.AI,Machine Learning
2852,신경망 및 딥 러닝,None,None,Intermediate,DeepLearning.AI,Java
1968,컨볼루션 신경망,None,None,Intermediate,DeepLearning.AI,Machine Learning
2844,컨볼루션 신경망,None,None,Intermediate,DeepLearning.AI,Java

In [26]:
# For the moment in time, I do not drop any row but when I face EDA I will have in mind that I have courses duplicated and
# probably, I will have to groupby course when the analysis requires it.

In [27]:
# Tengo cursos duplicados en mis diferentes búsquedas.
# Por ahora lo dejo indicado así y ya sé que de cara al EDA tendré que agrupar cuando me interese un análisis por curso.

In [28]:
# Here I export to csv as it is going to be useful for EDA.

In [29]:
duplicated.to_csv("duplicated.csv")

### Rating Column

In [30]:
# Transform Rating column to numeric as well as "None" string to nan data.

In [31]:
# Hago la columna Rating numérica y convierto mi string "None" en un nan

In [32]:
courses.rating.unique()

array(['4.6', '4.8', '4.7', '4.4', '4.3', '4.5', '4.9', 'None', '5',
       '3.9', '4.2', '4.1', '3.7', '4', '3.8', '3.4', '3', '3.3', '3.1',
       '2.8', '3.2', '3.6', '3.5', '2.3'], dtype=object)

In [33]:
courses['rating'] = pd.to_numeric(courses.rating, errors='coerce')

In [34]:
courses.rating.unique()

array([4.6, 4.8, 4.7, 4.4, 4.3, 4.5, 4.9, nan, 5. , 3.9, 4.2, 4.1, 3.7,
       4. , 3.8, 3.4, 3. , 3.3, 3.1, 2.8, 3.2, 3.6, 3.5, 2.3])

### Level Column

In [35]:
# Transform "None" string to None. For my analysis, it does not worth transform this column into numeric values.

In [36]:
courses.level.unique()

array(['Beginner', 'Intermediate', 'Mixed', 'Advanced', 'None'],
      dtype=object)

In [37]:
courses['level'].replace({"None":None}, inplace=True)

In [38]:
courses.level.unique()

array(['Beginner', 'Intermediate', 'Mixed', 'Advanced', None],
      dtype=object)

### Students Column

In [39]:
# Transform students column formed by strings into digits.

In [40]:
# Save into variable students a list of unique values of students.
students = list(courses.students.unique())

In [41]:
# Make a first transformation with Regex.
lista=[]
for i in students:
    lista.append(re.sub(" mil", "", i))

In [42]:
# Make a second transformation with Regex.
lista_2=[]
for i in lista:
    lista_2.append(re.sub(",", ".", i))

In [43]:
# Prepare a dictionary to replace directly in column student of dataframe courses.
dict_from_list = dict(zip(students, lista_2))

In [44]:
courses=courses.replace({"students": dict_from_list})

In [45]:
# This dictionary is for another transformation in column of students.

dict_={'1.2 m': 1200, '1 m': 1000, '2.7 m':2700, '2.5 m': 2500, '4.7 m':4700, '1.3 m':1300, '1.6 m': 1600, '1.1':1100}

In [46]:
courses=courses.replace({"students": dict_})

In [47]:
#courses.students.unique()

In [48]:
# Now This column is ready to be transformed into numeric values.
courses['students'] = pd.to_numeric(courses.students, errors='coerce')

In [49]:
print(courses.students.unique())

[4.0e+02 6.6e+02 1.4e+02 1.7e+02 5.8e+00 2.8e+01 3.9e+02     nan 8.6e+00
 5.0e+00 2.2e+01 1.9e+00 3.0e+02 2.0e+00 1.8e+00 1.1e+01 1.3e+02 4.5e+00
 5.6e+01 4.1e+01 1.8e+01 2.0e+01 2.9e+00 1.3e+01 1.1e+02 1.5e+02 5.2e+01
 3.2e+00 8.7e+00 2.8e+00 5.9e+01 1.7e+00 6.8e+00 6.2e+00 3.6e+02 3.5e+02
 3.5e+01 2.5e+02 4.6e+01 4.3e+01 2.7e+00 2.9e+01 5.0e+01 3.7e+02 1.6e+02
 2.4e+02 4.5e+01 9.5e+01 8.2e+01 2.1e+01 1.2e+01 5.7e+00 5.3e+01 3.4e+00
 1.5e+00 4.3e+00 1.4e+01 2.4e+00 5.2e+00 6.9e+00 3.3e+00 4.7e+00 2.5e+00
 4.2e+00 1.9e+02 2.7e+02 7.0e+01 7.5e+00 4.4e+01 7.6e+00 5.8e+01 2.2e+00
 3.6e+00 6.1e+00 4.8e+00 3.5e+00 1.7e+01 5.4e+00 2.3e+00 3.7e+01 5.1e+01
 9.8e+00 2.1e+00 3.0e+01 5.3e+00 6.5e+00 7.4e+02 2.0e+02 2.1e+02 2.4e+01
 1.0e+02 7.1e+02 4.8e+01 4.1e+00 3.9e+00 1.6e+01 2.7e+03 6.0e+02 5.2e+02
 5.7e+02 8.0e+02 2.5e+03 3.8e+02 4.7e+02 7.2e+02 7.3e+01 1.2e+02 4.0e+00
 1.6e+00 2.8e+02 2.5e+01 5.0e+02 7.5e+01 4.7e+03 2.3e+02 8.3e+02 3.3e+02
 5.4e+01 5.5e+02 4.6e+00 4.1e+02 4.9e+01 2.7e+01 9.7e+01 9.3e+00 2.2e+02
 8.5e+01 3.2e+01 3.9e+01 6.2e+01 8.4e+01 6.6e+00 3.6e+01 8.5e+00 9.9e+00
 3.3e+01 3.0e+00 3.1e+00 2.6e+00 7.9e+00 5.9e+00 1.0e+01 6.0e+00 8.4e+00
 7.7e+00 4.4e+00 9.0e+00 3.7e+00 4.7e+01 7.8e+00 2.6e+01 6.3e+00 6.9e+02
 5.3e+02 4.0e+01 7.4e+00 7.0e+00 7.6e+01 8.3e+01 1.2e+03 5.1e+02 6.3e+01
 3.1e+01 4.9e+02 1.0e+03 2.6e+02 4.4e+02 8.9e+00 3.4e+02 1.5e+01 3.8e+01
 6.9e+01 4.3e+02 9.1e+01 9.3e+01 9.7e+00 9.1e+00 3.8e+00 1.9e+01 2.3e+01
 8.0e+00 7.3e+00 9.6e+00 7.1e+00 5.5e+01 5.5e+00 5.6e+00 9.5e+00 6.6e+01
 4.2e+01 8.1e+00 8.8e+00 5.9e+02 7.9e+01 6.4e+00 5.7e+01 6.5e+01 9.2e+01
 7.2e+00 4.9e+00 8.8e+01 6.7e+00 6.4e+01 2.9e+02 9.2e+00 7.5e+02 6.8e+02
 6.1e+02 5.8e+02 6.5e+02 1.8e+02 3.2e+02 8.9e+01 6.1e+01 9.4e+00 8.1e+01
 6.7e+01 5.1e+00 8.3e+00 3.4e+01 8.2e+00 9.2e+02 7.4e+01 8.6e+01 4.8e+02
 9.4e+01 1.3e+03 5.4e+02 4.6e+02 7.8e+01 7.7e+01 6.0e+01 8.7e+01 7.2e+01
 8.0e+01 6.7e+02 4.5e+02 7.9e+02 1.6e+03 9.9e+01 6.3e+02 6.8e+01]

In [50]:
courses.head()

,course,rating,students,level,university,skills
0,Learn SQL Basics for Data Science,4.6,400.0,Beginner,"University of California, Davis",MySQL
1,Excel to MySQL: Analytic Techniques for Business,4.6,660.0,Beginner,Duke University,MySQL
2,Introduction to Structured Query Language (SQL),4.8,140.0,Intermediate,University of Michigan,MySQL
3,Managing Big Data with MySQL,4.7,170.0,Mixed,Duke University,MySQL
4,Building a Dynamic Web App using PHP & MySQL,4.4,5.8,Beginner,Coursera Project Network,MySQL

In [51]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3140 entries, 0 to 3139
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   course      3140 non-null   object
 1   rating      2444 non-null   float64
 2   students    2030 non-null   float64
 3   level       3096 non-null   object
 4   university  3140 non-null   object
 5   skills      3140 non-null   object
dtypes: float64(2), object(4)
memory usage: 147.3+ KB

In [52]:
courses.shape

(3140, 6)

In [53]:
# Export this dataframe into csv
courses.to_csv("coursera_cleaned.csv")